import React from 'react';

const Question = () => {
    return (
        <div>
            <h3> How react work?</h3>
            <h5> React হলো একটি জাভাস্ক্রিপ্ট লাইব্রেরি যা যোষণামূলক কো ব্যবহার করে অনুমানযোগ্য এবং দক্ষ উপায়ে ব্যবহারকারী ইন্টারফেস(UI) তৈরি করে। <br></br>আপনি  এটি ব্যবহার করতে পারেন একক পৃষ্ঠার অ্যাপ্লিকেশন এবং মোবাইল অ্যাপ্লিকেশন তৈরি করতে,<br></br> অথবা আপনি যদি অন্য লাইব্রেরির সাথে এটি ব্যবহার করেন তবে জটিল অ্যাপ্লিকেশন তৈরি করতে। </h5>

            <h3> Props and states difference?</h3>
            <p>Props শুধুমাত্র পঠনযোগ্য উপাদান। এটি এমন একটি অবজেক্ট যা ট্যাগের অ্যাট্রিবিউটের মান সঞ্চয় করে এবং Html অ্যাট্রিবিউটের মতো কাজ করে। এটি একটি উপাদান থেকে অন্য উপাদান থেকে অন্য উপাদানে ডেটা পাস করার অনুমতি দেয়। এটি ফাংশন আর্গুমেন্টের অনুরুপ এবং একটি ফাংশনে পাস করা আগুমেনেটর মতো একইভাবে উপাদানে প্রেরণ করা যেতে পারে। Props অপরিবর্তনীয় তাই আমরা উপাদানের ভিতরে থেকে Prop গুলি পরিবর্তন করতে পারি না</p>
            <p> state একটি আপডেটযোগ্য কাঠামো যা উপাদান সম্পর্কে ডেটা বা তথ্য ধারণ করতে ব্যবহৃত হয় এবং সময়ের সাথে সাথে পরিবর্তন হতে পারে। অবস্থার পরিবর্তন ব্যবহারকারীর ক্রিয়া বা সিস্টেম ইভেন্টের প্রতিক্রিয়া হিসাবে ঘটতে পারে। এটি প্রতিক্রিয়া উপাদানের হৃদর যা উপাদানটির আচরণ এবং এটি কীভাবে রেন্ডার করবে তা নির্ধারণ করে। একটি State  যতটা সম্ভব সহজ রাখা অ</p>
        </div>
    );
};

export default Question;